Armisuari/esp32-sim7600e/examples/basic_usage/sdkconfig.defaults
#
# ESP32-S3 SIM7600E Project Default Configuration
# This file contains the default configuration settings for the project
# Based on README specifications and Kconfig options
#

#
# Target Configuration
#
CONFIG_IDF_TARGET="esp32s3"

#
# CPU Frequency
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

#
# FreeRTOS Configuration
#
CONFIG_FREERTOS_HZ=100
# Dual core configuration (ESP32-S3 has 2 cores)
# CONFIG_FREERTOS_UNICORE is not set

#
# Main Task Configuration
#
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

#
# Partition Table
#
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

#
# ESP32-S3 Specific Configuration
#
CONFIG_ESP32S3_REV_MIN_0=y
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_FOUR=y
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES=4

#
# Cache Configuration
#
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_SIZE=0x4000
CONFIG_ESP32S3_INSTRUCTION_CACHE_8WAYS=y
CONFIG_ESP32S3_ICACHE_ASSOCIATED_WAYS=8
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_SIZE=32

#
# SIM7600E Component Configuration
#
CONFIG_SIM7600E_UART_PORT_NUM=2
CONFIG_SIM7600E_TX_GPIO=2
CONFIG_SIM7600E_RX_GPIO=1
CONFIG_SIM7600E_PWRKEY_GPIO=41
CONFIG_SIM7600E_UART_BAUD_RATE=115200
CONFIG_SIM7600E_UART_BUF_SIZE=1024

#
# SIM7600E Queue Configuration
#
CONFIG_SIM7600E_URC_QUEUE_SIZE=10
CONFIG_SIM7600E_RESP_QUEUE_SIZE=5
CONFIG_SIM7600E_GNSS_QUEUE_SIZE=1

#
# SIM7600E GNSS Configuration
#
CONFIG_SIM7600E_GNSS_DEFAULT_UPDATE_RATE=1000
CONFIG_SIM7600E_GNSS_ENABLE_GPS=y
CONFIG_SIM7600E_GNSS_ENABLE_GLONASS=y
# CONFIG_SIM7600E_GNSS_ENABLE_GALILEO is not set
# CONFIG_SIM7600E_GNSS_ENABLE_BEIDOU is not set

#
# SIM7600E TCP Configuration
#
CONFIG_SIM7600E_TCP_DEFAULT_TIMEOUT=30000
# CONFIG_SIM7600E_TCP_KEEPALIVE_ENABLE is not set

#
# SIM7600E Logging Configuration
#
CONFIG_SIM7600E_LOG_LEVEL=3

#
# Serial Console Configuration
#
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

#
# Log Configuration
#
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_LOG_MAXIMUM_LEVEL=3

#
# Component Configuration for SIM7600E
#
# WiFi Configuration (may be needed for some applications)
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Bluetooth (if needed for your application)
# CONFIG_BT_ENABLED=y

#
# LWIP Configuration for network connectivity
#
CONFIG_LWIP_IPV4=y
CONFIG_LWIP_IPV6=y

#
# HTTP Client (useful for SIM7600E TCP/HTTP operations)
#
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

#
# mbedTLS (for secure connections)
#
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

#
# NVS (Non-Volatile Storage)
#
# Disable NVS encryption for now to avoid eFuse configuration issues
# CONFIG_NVS_ENCRYPTION=y

#
# Power Management
#
# CONFIG_PM_ENABLE=y

#
# Watchdog Configuration
#
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

#
# Memory Configuration
#
# Enable PSRAM if your board has it (ESP32-S3 boards often do)
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM_SPEED_80M=y

#
# Application specific settings
#
# Increase stack sizes if needed for SIM7600E operations
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096